# YOLOv5 🚀 by Ultralytics, AGPL-3.0 license

# Parameters
nc: 8  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.25  # layer channel multiple
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  [
   [-1, 1, GhostNet, [40, 1]],  #0-P3/8  80*80 
   [-1, 1, GhostNet, [112, 2]], #1-P4/16 40*40
   [-1, 1, GhostNet, [160, 3]], #2-P5/32 20*20
   [-1, 1, SPPF, [1024, 5]]     #3 [-1, 1, SPPF, [576, 5]] 
  ]

# YOLOv5 head
head:
  [[-1, 1, Conv, [512, 1, 1]],                        # 4 head P5
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],        # 5
   [[-1, 1], 1, Concat, [1]],  # cat backbone P4      # 6
   [-1, 1, C3, [512, False]],                         # 7
  

   [-1, 1, Conv, [256, 1, 1]],                       # 8 head P4
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],       # 9
   [[-1, 0], 1, Concat, [1]],  # cat backbone P3     # 10
   [-1, 1, C3, [256, False]],  # 14 (P3/8-small)     # 11
  

   [-1, 1, Conv, [128, 3, 2]],                      # 12
   [[-1, 8], 1, Concat, [1]],  # cat head P4       # 13
   [-1, 1, C3, [256, False]],  # 17 (P4/16-medium)  # 14


   [-1, 1, Conv, [256, 3, 2]],                      # 15
   [[-1, 4], 1, Concat, [1]],  # cat head P5        # 16
   [-1, 1, C3, [512, False]],  # 20 (P5/32-large)   # 17
   

   [[11, 14, 17], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
  ]