# YOLOv5 🚀 by Ultralytics, AGPL-3.0 license

# Parameters
nc: 8  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.25  # layer channel multiple
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  [
   [-1, 1, Lcnet, [16, 1]],    #0-P1/2  320*320
   [-1, 1, Lcnet, [48, 2]],    #1-P2/4  160*160
   [-1, 1, Lcnet, [96, 3]],   #2-P3/8  80*80
   [-1, 1, Lcnet, [192, 4]],   #3-P4/16 40*40
   [-1, 1, Lcnet, [384, 5]],   #4-P5/32 20*20
   [-1, 1, SPPF, [1024, 5]]    #5
  ]

# YOLOv5 head
head:
  [[-1, 1, Conv, [512, 1, 1]],                        # 6 head P5
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],        # 7
   [[-1, 3], 1, Concat, [1]],  # cat backbone P4      # 8
   [-1, 1, C3, [512, False]],                         # 9
  

   [-1, 1, Conv, [256, 1, 1]],                       # 10 head P4
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],       # 11
   [[-1, 2], 1, Concat, [1]],  # cat backbone P3     # 12
   [-1, 1, C3, [256, False]],  # 14 (P3/8-small)     # 13
  

   [-1, 1, Conv, [128, 3, 2]],                      # 14
   [[-1, 10], 1, Concat, [1]],  # cat head P4       # 15
   [-1, 1, C3, [256, False]],  # 17 (P4/16-medium)  # 16


   [-1, 1, Conv, [256, 3, 2]],                      # 17
   [[-1, 6], 1, Concat, [1]],  # cat head P5        # 18
   [-1, 1, C3, [512, False]],  # 20 (P5/32-large)   # 19
   

   [[13, 16, 19], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
  ]