# YOLOv5 🚀 by Ultralytics, AGPL-3.0 license

# Parameters
nc: 8  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.25  # layer channel multiple
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  [
   [-1, 1, MobileNetv3, [16, 1]],             #0-P1/2  320*320
   [-1, 1, MobileNetv3, [8, 2]],              #1-P2/4  160*160
   [-1, 1, MobileNetv3, [16, 3]],             #2-P3/8  80*80
   [-1, 1, MobileNetv3, [24, 4]],             #3-P4/16 40*40
   [-1, 1, MobileNetv3, [288, 5]],            #4-P5/32 20*20
   [-1, 1, SPPF, [1024, 5]]                   #5[-1, 1, SPPF, [576, 5]] 
  ]

# YOLOv5 v6.0 head
head:
  [[-1, 1, Conv, [512, 1, 1]],                    #6 head p5
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],    #7
   [[-1, 3], 1, Concat, [1]],                     #8 cat backbone P4
   [-1, 3, C3, [512, False]],                     #9

   [-1, 1, Conv, [256, 1, 1]],                    #10 head p4
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],    #11
   [[-1, 2], 1, Concat, [1]],                     #12 cat backbone P3
   [-1, 3, C3, [256, False]],                     #13 (P3/8-small)

   [-1, 1, Conv, [256, 3, 2]],                    #14
   [[-1, 10], 1, Concat, [1]],                    #15 cat head P4
   [-1, 3, C3, [512, False]],                     #16 (P4/16-medium)

   [-1, 1, Conv, [512, 3, 2]],                    #17
   [[-1, 6], 1, Concat, [1]],                     #18 cat head P5
   [-1, 3, C3, [1024, False]],                    #19 (P5/32-large)

   [[13, 16, 19], 1, Detect, [nc, anchors]],      # Detect(P3, P4, P5)
  ]
